possible_hello = ["Привет ", "Здарова ", "Приветствую тебя ", "Охохо, какие люди! Здавствуй ", "Какие люди. Здарова ",
                  "Ну вот и ты ", "Наконецто ты пришёл, ", "Вот он, новая надежда Таркова! Здравствуй ",
                  "Ну проходи, присаживайся ", "Дошёл ,да?\nТогда привет тебе, ",
                  "О, опять новое лицо!\nПоприветствуйте "]

possible_request = ["Ага, да, умный нашёлся?", "Да были, помню, ходили тут, вопросы задавали",
                    "Сча позвоню парням, может придёт кто",
                    "Так, служивый, не выделывайся, все списки живых у тебя на руках",
                    "А чё такое, умертвить кого захотел, служивый?",
                    "Пару 200-сотых, пару 300-тых, но в основном все живы"]

people_helpers = ["Помощник номер один", "Помощник номер два", "Помощник номер три"]

USER_AGENT = {
  "user-agent":
    "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/98.0.4758.82 Safari/537.36",
  "x-requested-with":
    "XMLHttpRequest"
}

url = "https://tarkovwiki.ru/search/node/"
url_gallery = "https://escapefromtarkov.fandom.com/ru/wiki/%D0%A1%D0%BB%D1%83%D0%B6%D0%B5%D0%B1%D0%BD%D0%B0%D1%8F:%D0%9F%D0%BE%D0%B8%D1%81%D0%BA?query="
url_gallery_end = "&scope=internal&navigationSearch=true"