possible_hello = ["Привет ", "Здарова ", "Приветствую тебя ", "Охохо, какие люди! Здавствуй ", "Какие люди. Здарова ",
                  "Ну вот и ты ", "Наконецто ты пришёл, ", "Вот он, новая надежда Таркова! Здравствуй ",
                  "Ну проходи, присаживайся ", "Дошёл ,да?\nТогда привет тебе, ",
                  "О, опять новое лицо!\nПоприветствуйте "]

possible_request = ["Ага, да, умный нашёлся?", "Да были, помню, ходили тут, вопросы задавали",
                    "Сча позвоню парням, может придёт кто",
                    "Так, служивый, не выделывайся, все списки живых у тебя на руках",
                    "А чё такое, умертвить кого захотел, служивый?",
                    "Пару 200-сотых, пару 300-тых, но в основном все живы"]


possible_hello_for_new_user = ["Вы только взгляните на новое лицо!\nЗдарова ",
                               "Смотрите, пришёл всё-таки наш новичёк!\nНу привет ",
                               "Охохо, какие люди, вы только гляньте на него.\nПоприветствуем же ",
                               "Вот она, новая надежда таркова!\nПоздаровайтесь с ",
                               "Новый в наших рядах!\nСкажите привет собрату ",
                               "Ну заходи, не стесняйся!\nСобраты, нука живо поприветствуйте новичка ",
                               "Ну вот и ты.\nБратья по оружию, знакомьтесь с новым игроком ",
                               "ООО, служивый!Ну ты заходи, присаживайся, чая может тебе налить? Хе-Хе\nПривет-Привет ",
                               "О, новое лицо.Здарова ",
                               "Надеюсь тебе у нас понравится, новоприбывший ",
                               "Хм, новое тело, и даже не 200ое, и, вроде не 300ое.\nНу здравствуй ",
                               "Это что, Новая Надежда Таркова?\nХа-Ха-Ха\nНу посмотрим на что ты сгодишься ",
                               "Парни, новый на горизонте!\nСкажите привет ",
                               "Да чтоб меня, какие люди!\nПривет "]


USER_AGENT = {
  "user-agent":
    "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/98.0.4758.82 Safari/537.36",
  "x-requested-with":
    "XMLHttpRequest"
}

url = "https://tarkovwiki.ru/search/node/"
url_gallery = "https://escapefromtarkov.fandom.com/ru/wiki/%D0%A1%D0%BB%D1%83%D0%B6%D0%B5%D0%B1%D0%BD%D0%B0%D1%8F:%D0%9F%D0%BE%D0%B8%D1%81%D0%BA?query="
url_gallery_end = "&scope=internal&navigationSearch=true"